
  #### Terraform Plan
  <details>
    <summary>Expand</summary>
    <pre>Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/infra-shared/runs/run-ccBhReBXKu5yoMht

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
module.iam.aws_iam_group.deployer: Refreshing state... [id=deployer]
module.iam.aws_iam_group_policy_attachment.deployer: Refreshing state... [id=deployer-20220604232226560500000001]
module.iam.aws_iam_user.deployer: Refreshing state... [id=deployer]
module.iam.aws_iam_user_group_membership.deployer: Refreshing state... [id=terraform-20220604232226591200000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.iam.aws_iam_group.administrators will be created
  + resource "aws_iam_group" "administrators" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "administrators"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.iam.aws_iam_group.deployer will be destroyed
  # (because aws_iam_group.deployer is not in configuration)
  - resource "aws_iam_group" "deployer" {
      - arn       = "arn:aws:iam::920122847127:group/deployer" -> null
      - id        = "deployer" -> null
      - name      = "deployer" -> null
      - path      = "/" -> null
      - unique_id = "AGPA5MO4YN6L2IROIUTOV" -> null
    }

  # module.iam.aws_iam_group_policy_attachment.administrators will be created
  + resource "aws_iam_group_policy_attachment" "administrators" {
      + group      = "administrators"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.iam.aws_iam_group_policy_attachment.deployer will be destroyed
  # (because aws_iam_group_policy_attachment.deployer is not in configuration)
  - resource "aws_iam_group_policy_attachment" "deployer" {
      - group      = "deployer" -> null
      - id         = "deployer-20220604232226560500000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
    }

  # module.iam.aws_iam_user.tvink will be created
  + resource "aws_iam_user" "tvink" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "tvink"
      + path          = "/"
      + tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
      + unique_id     = (known after apply)
    }

  # module.iam.aws_iam_user_group_membership.deployer will be updated in-place
  ~ resource "aws_iam_user_group_membership" "deployer" {
      ~ groups = [
          + "administrators",
          - "deployer",
        ]
        id     = "terraform-20220604232226591200000002"
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_user_group_membership.tvink will be created
  + resource "aws_iam_user_group_membership" "tvink" {
      + groups = [
          + "administrators",
        ]
      + id     = (known after apply)
      + user   = "tvink"
    }

Plan: 4 to add, 1 to change, 2 to destroy.

</pre>
  </details>
